## Production: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 15 to add, 7 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                  NAME                                  |
|----------|------------------------------------------------------------------------|
| update   | `aws_cloudwatch_metric_alarm.sqs-priority-queue-delay-critical`        |
|          | `aws_wafv2_regex_pattern_set.re_admin`                                 |
|          | `module.athena_logs_bucket.aws_s3_bucket.this`                         |
|          | `module.bulk_send_logs.aws_s3_bucket.this`                             |
|          | `module.csv_bucket_logs.aws_s3_bucket.this`                            |
|          | `module.document_download_logs.aws_s3_bucket.this`                     |
|          | `module.document_download_logs.aws_s3_bucket_acl.this`                 |
| recreate | `module.csv_bucket_logs.aws_s3_bucket_public_access_block.this`        |
|          | `module.document_download_logs.aws_s3_bucket_public_access_block.this` |
| add      | `module.athena_logs_bucket.aws_s3_bucket_acl.this`                     |
|          | `module.athena_logs_bucket.aws_s3_bucket_ownership_controls.this`      |
|          | `module.athena_logs_bucket.aws_s3_bucket_policy.this`                  |
|          | `module.athena_logs_bucket.aws_s3_bucket_public_access_block.this`     |
|          | `module.bulk_send_logs.aws_s3_bucket_acl.this`                         |
|          | `module.bulk_send_logs.aws_s3_bucket_ownership_controls.this`          |
|          | `module.bulk_send_logs.aws_s3_bucket_policy.this`                      |
|          | `module.bulk_send_logs.aws_s3_bucket_public_access_block.this`         |
|          | `module.csv_bucket_logs.aws_s3_bucket_acl.this`                        |
|          | `module.csv_bucket_logs.aws_s3_bucket_ownership_controls.this`         |
|          | `module.csv_bucket_logs.aws_s3_bucket_policy.this`                     |
|          | `module.document_download_logs.aws_s3_bucket_ownership_controls.this`  |
|          | `module.document_download_logs.aws_s3_bucket_policy.this`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.sqs-priority-queue-delay-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-priority-queue-delay-critical" {
      ~ alarm_description         = "ApproximateAgeOfOldestMessage in high priority queue >= 60 seconds for 1 minute" -> "ApproximateAgeOfOldestMessage in high priority queue >= 60 seconds for 5 minutes"
      ~ datapoints_to_alarm       = 0 -> 5
      ~ evaluation_periods        = 1 -> 5
        id                        = "sqs-priority-queue-delay-critical"
        tags                      = {}
        # (15 unchanged attributes hidden)
    }

  # aws_wafv2_regex_pattern_set.re_admin will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "re_admin" {
        id          = "ac161757-5887-4282-a156-7c9bf6afc7b8"
        name        = "re_admin"
        tags        = {
            "CostCenter" = "notification-canada-ca-production"
        }
        # (5 unchanged attributes hidden)

      + regular_expression {
          + regex_string = "/keep-accurate-contact-information|/maintenez-a-jour-les-coordonnees|/delivery-and-failure|/livraison-reussie-et-echec"
        }
        # (9 unchanged blocks hidden)
    }

  # module.athena_logs_bucket.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined"  {
      ~ id                      = "1249028419" -> (known after apply)
      ~ json                    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::notification-canada-ca-production-athena-logs/*",
                          - "arn:aws:s3:::notification-canada-ca-production-athena-logs",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ source_policy_documents = [
          - jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = "s3:*"
                          - Condition = {
                              - Bool = {
                                  - aws:SecureTransport = "false"
                                }
                            }
                          - Effect    = "Deny"
                          - Principal = "*"
                          - Resource  = [
                              - "arn:aws:s3:::notification-canada-ca-production-athena-logs/*",
                              - "arn:aws:s3:::notification-canada-ca-production-athena-logs",
                            ]
                          - Sid       = "denyInsecureTransport"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ),
        ] -> (known after apply)
      - version                 = "2012-10-17" -> null
    }

  # module.athena_logs_bucket.data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport"  {
      ~ id      = "3340225368" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::notification-canada-ca-production-athena-logs/*",
                          - "arn:aws:s3:::notification-canada-ca-production-athena-logs",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }
    }

  # module.athena_logs_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
      + force_destroy               = false
        id                          = "notification-canada-ca-production-athena-logs"
      ~ tags                        = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Critical"   = "true"
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
      ~ tags_all                    = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Critical"   = "true"
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)




        # (5 unchanged blocks hidden)
    }

  # module.athena_logs_bucket.aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "log-delivery-write"
      + bucket = "notification-canada-ca-production-athena-logs"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.athena_logs_bucket.aws_s3_bucket_ownership_controls.this will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = "notification-canada-ca-production-athena-logs"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.athena_logs_bucket.aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = "notification-canada-ca-production-athena-logs"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.athena_logs_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.bulk_send_logs.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined"  {
      ~ id                      = "3454840538" -> (known after apply)
      ~ json                    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::notification-canada-ca-production-bulk-send-logs/*",
                          - "arn:aws:s3:::notification-canada-ca-production-bulk-send-logs",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ source_policy_documents = [
          - jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = "s3:*"
                          - Condition = {
                              - Bool = {
                                  - aws:SecureTransport = "false"
                                }
                            }
                          - Effect    = "Deny"
                          - Principal = "*"
                          - Resource  = [
                              - "arn:aws:s3:::notification-canada-ca-production-bulk-send-logs/*",
                              - "arn:aws:s3:::notification-canada-ca-production-bulk-send-logs",
                            ]
                          - Sid       = "denyInsecureTransport"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ),
        ] -> (known after apply)
      - version                 = "2012-10-17" -> null
    }

  # module.bulk_send_logs.data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport"  {
      ~ id      = "1266768303" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::notification-canada-ca-production-bulk-send-logs/*",
                          - "arn:aws:s3:::notification-canada-ca-production-bulk-send-logs",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }
    }

  # module.bulk_send_logs.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
      + force_destroy               = false
        id                          = "notification-canada-ca-production-bulk-send-logs"
      ~ tags                        = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Critical"   = "true"
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
      ~ tags_all                    = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Critical"   = "true"
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)




        # (5 unchanged blocks hidden)
    }

  # module.bulk_send_logs.aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "log-delivery-write"
      + bucket = "notification-canada-ca-production-bulk-send-logs"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.bulk_send_logs.aws_s3_bucket_ownership_controls.this will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = "notification-canada-ca-production-bulk-send-logs"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.bulk_send_logs.aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = "notification-canada-ca-production-bulk-send-logs"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.bulk_send_logs.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.csv_bucket_logs.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined"  {
      ~ id                      = "2337185328" -> (known after apply)
      ~ json                    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::notification-canada-ca-production-csv-upload-logs/*",
                          - "arn:aws:s3:::notification-canada-ca-production-csv-upload-logs",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ source_policy_documents = [
          - jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = "s3:*"
                          - Condition = {
                              - Bool = {
                                  - aws:SecureTransport = "false"
                                }
                            }
                          - Effect    = "Deny"
                          - Principal = "*"
                          - Resource  = [
                              - "arn:aws:s3:::notification-canada-ca-production-csv-upload-logs/*",
                              - "arn:aws:s3:::notification-canada-ca-production-csv-upload-logs",
                            ]
                          - Sid       = "denyInsecureTransport"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ),
        ] -> (known after apply)
      - version                 = "2012-10-17" -> null
    }

  # module.csv_bucket_logs.data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport"  {
      ~ id      = "1221183552" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::notification-canada-ca-production-csv-upload-logs/*",
                          - "arn:aws:s3:::notification-canada-ca-production-csv-upload-logs",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }
    }

  # module.csv_bucket_logs.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
      + force_destroy               = false
        id                          = "notification-canada-ca-production-csv-upload-logs"
      ~ tags                        = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Critical"   = "true"
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
      ~ tags_all                    = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Critical"   = "true"
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)




        # (5 unchanged blocks hidden)
    }

  # module.csv_bucket_logs.aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "log-delivery-write"
      + bucket = "notification-canada-ca-production-csv-upload-logs"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.csv_bucket_logs.aws_s3_bucket_ownership_controls.this will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = "notification-canada-ca-production-csv-upload-logs"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.csv_bucket_logs.aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = "notification-canada-ca-production-csv-upload-logs"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.csv_bucket_logs.aws_s3_bucket_public_access_block.this must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "notification-canada-ca-production-csv-upload-logs" -> (known after apply) # forces replacement
      ~ id                      = "notification-canada-ca-production-csv-upload-logs" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.document_download_logs.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined"  {
      ~ id                      = "1040053134" -> (known after apply)
      ~ json                    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::notification-canada-ca-production-document-download-logs/*",
                          - "arn:aws:s3:::notification-canada-ca-production-document-download-logs",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ source_policy_documents = [
          - jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = "s3:*"
                          - Condition = {
                              - Bool = {
                                  - aws:SecureTransport = "false"
                                }
                            }
                          - Effect    = "Deny"
                          - Principal = "*"
                          - Resource  = [
                              - "arn:aws:s3:::notification-canada-ca-production-document-download-logs/*",
                              - "arn:aws:s3:::notification-canada-ca-production-document-download-logs",
                            ]
                          - Sid       = "denyInsecureTransport"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ),
        ] -> (known after apply)
      - version                 = "2012-10-17" -> null
    }

  # module.document_download_logs.data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport"  {
      ~ id      = "2509325018" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::notification-canada-ca-production-document-download-logs/*",
                          - "arn:aws:s3:::notification-canada-ca-production-document-download-logs",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }
    }

  # module.document_download_logs.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
      + force_destroy               = false
        id                          = "notification-canada-ca-production-document-download-logs"
      ~ tags                        = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Critical"   = "true"
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
      ~ tags_all                    = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Critical"   = "true"
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)




        # (5 unchanged blocks hidden)
    }

  # module.document_download_logs.aws_s3_bucket_acl.this will be updated in-place
  ~ resource "aws_s3_bucket_acl" "this" {
      + acl    = "log-delivery-write"
        id     = "notification-canada-ca-production-document-download-logs"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.document_download_logs.aws_s3_bucket_ownership_controls.this will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = "notification-canada-ca-production-document-download-logs"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.document_download_logs.aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = "notification-canada-ca-production-document-download-logs"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.document_download_logs.aws_s3_bucket_public_access_block.this must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "notification-canada-ca-production-document-download-logs" -> (known after apply) # forces replacement
      ~ id                      = "notification-canada-ca-production-document-download-logs" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 15 to add, 7 to change, 2 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 59 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-email-created-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-email-created-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-sms-created-critical"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
